driver-tests/bpelse/assign/AssignJbi/test/CopyshortInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <shortPart>
	<xsd_short>1000</xsd_short>
	<optional_short>20</optional_short>
	<repeat_short>20</repeat_short>
	<repeat_short>1</repeat_short>
   </shortPart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
